Build output
stdout<<ghadelimiter_0f997fa7-4d52-4e86-ab09-5f1ef13dfeba
Terraform v1.4.6
on linux_amd64
+ provider registry.terraform.io/hashicorp/google v4.73.1
+ provider registry.terraform.io/hashicorp/google-beta v4.73.1

Your version of Terraform is out of date! The latest version
is 1.5.3. You can update by downloading from https://www.terraform.io/downloads.html

ghadelimiter_0f997fa7-4d52-4e86-ab09-5f1ef13dfeba
stderr<<ghadelimiter_6972c66a-6c5e-441b-b84d-d803fa4c39bc

ghadelimiter_6972c66a-6c5e-441b-b84d-d803fa4c39bc
exitcode<<ghadelimiter_101cdf78-89d0-4e85-95c8-1968554766ff
0
ghadelimiter_101cdf78-89d0-4e85-95c8-1968554766ff
[command]/home/runner/work/_temp/9079ce4e-8e98-468a-ae49-4ea404f5a6c6/terraform-bin plan -input=false
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_compute_network.network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m network           = {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m description                               = ""
      [32m+[0m[0m enable_ula_internal_ipv6                  = [90mnull[0m[0m
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
      [32m+[0m[0m timeouts                                  = [90mnull[0m[0m
    }
  [32m+[0m[0m network_id        = (known after apply)
  [32m+[0m[0m network_name      = "vpc-test-deploy-392912-prod"
  [32m+[0m[0m network_self_link = (known after apply)
  [32m+[0m[0m project_id        = "test-deploy-392912"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # google_compute_network.network[0m will be created%0A[0m  [32m+[0m[0m resource "google_compute_network" "network" {%0A      [32m+[0m[0m auto_create_subnetworks                   = false%0A      [32m+[0m[0m delete_default_routes_on_create           = false%0A      [32m+[0m[0m gateway_ipv4                              = (known after apply)%0A      [32m+[0m[0m id                                        = (known after apply)%0A      [32m+[0m[0m internal_ipv6_range                       = (known after apply)%0A      [32m+[0m[0m mtu                                       = 0%0A      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"%0A      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      [32m+[0m[0m project                                   = "test-deploy-392912"%0A      [32m+[0m[0m routing_mode                              = "GLOBAL"%0A      [32m+[0m[0m self_link                                 = (known after apply)%0A    }%0A%0A[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m network           = {%0A      [32m+[0m[0m auto_create_subnetworks                   = false%0A      [32m+[0m[0m delete_default_routes_on_create           = false%0A      [32m+[0m[0m description                               = ""%0A      [32m+[0m[0m enable_ula_internal_ipv6                  = [90mnull[0m[0m%0A      [32m+[0m[0m gateway_ipv4                              = (known after apply)%0A      [32m+[0m[0m id                                        = (known after apply)%0A      [32m+[0m[0m internal_ipv6_range                       = (known after apply)%0A      [32m+[0m[0m mtu                                       = 0%0A      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"%0A      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      [32m+[0m[0m project                                   = "test-deploy-392912"%0A      [32m+[0m[0m routing_mode                              = "GLOBAL"%0A      [32m+[0m[0m self_link                                 = (known after apply)%0A      [32m+[0m[0m timeouts                                  = [90mnull[0m[0m%0A    }%0A  [32m+[0m[0m network_id        = (known after apply)%0A  [32m+[0m[0m network_name      = "vpc-test-deploy-392912-prod"%0A  [32m+[0m[0m network_self_link = (known after apply)%0A  [32m+[0m[0m project_id        = "test-deploy-392912"%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_85db6e62-38ef-4ca6-b92c-afdcf222e9ee
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_compute_network.network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m network           = {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m description                               = ""
      [32m+[0m[0m enable_ula_internal_ipv6                  = [90mnull[0m[0m
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-test-deploy-392912-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "test-deploy-392912"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
      [32m+[0m[0m timeouts                                  = [90mnull[0m[0m
    }
  [32m+[0m[0m network_id        = (known after apply)
  [32m+[0m[0m network_name      = "vpc-test-deploy-392912-prod"
  [32m+[0m[0m network_self_link = (known after apply)
  [32m+[0m[0m project_id        = "test-deploy-392912"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_85db6e62-38ef-4ca6-b92c-afdcf222e9ee
stderr<<ghadelimiter_bd8a7320-4324-4e86-a3f9-8119234f090b

ghadelimiter_bd8a7320-4324-4e86-a3f9-8119234f090b
exitcode<<ghadelimiter_2701293d-dce3-4609-b1c3-5708b5bd7fbb
0
ghadelimiter_2701293d-dce3-4609-b1c3-5708b5bd7fbb